RIET/src/InformationRegisters/DGFShipperConsingToSettings/DGFShipperConsingToSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>DGFShipperConsingToSettings</name>
  <dimensions>
    <name>Shipper</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ConsignTo</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/DGFShipperConsingToSettings/ManagerModule.bsl
Функция ЕстьСоответствие(Shipper, ConsignTo) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	DGFShipperConsingToSettings.Shipper,
	|	DGFShipperConsingToSettings.ConsignTo
	|ИЗ
	|	РегистрСведений.DGFShipperConsingToSettings КАК DGFShipperConsingToSettings
	|ГДЕ
	|	DGFShipperConsingToSettings.Shipper = &Shipper
	|	И DGFShipperConsingToSettings.ConsignTo = &ConsignTo";
	
	Запрос.УстановитьПараметр("Shipper", Shipper);
	Запрос.УстановитьПараметр("ConsignTo", ConsignTo);
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой(); 
	
КонецФункции
